<?php

return [
    'required'         => ':attribute ველი აუცილებელია.',
    'email'            => ':attribute უნდა იყოს ვალიდური ელ-ფოსტის მისამართი.',
    'mimes'            => ':attribute უნდა იყოს სურათის ფორმატის.',
    'date'             => 'გთხოვთ მიუთითოთ სწორი :attribute.',
    'after'            => ':attribute უნდა იყოს მომავლის თარიღი.',
    'regex'            => ':attribute შეიცავს დაუშვებელ სიმბოლოებს.',

    'max'              => [
        'file'   => ':attribute არ უნდა აღემატებოდეს :max კილობაიტს (2MB).',
        'string' => ':attribute არ უნდა აღემატებოდეს :max სიმბოლოს.',
    ],
    'required_with'    => 'გთხოვთ მიუთითოთ :attribute.',
    'current_password' => 'მიმდინარე პაროლი არასწორია.',
    'min'              => [
        'string' => ':attribute უნდა შეიცავდეს მინიმუმ :min სიმბოლოს.',
    ],
    'different'        => ':attribute უნდა განსხვავდებოდეს ძველი პაროლისგან.',
    'confirmed'        => 'პაროლები არ ემთხვევა ერთმანეთს.',
    'failed_login' => 'მოცემული მონაცემები არასწორია.',
    'custom' => [
        'title' => [
            'en' => [
                'regex' => 'ინგლისური სათაური უნდა შეიცავდეს მხოლოდ ინგლისურ სიმბოლოებს.',
            ],
            'ka' => [
                'regex' => 'ქართული სათაური უნდა შეიცავდეს მხოლოდ ქართულ სიმბოლოებს.',
            ],
        ],
        'description' => [
            'en' => [
                'regex' => 'ინგლისური აღწერა უნდა შეიცავდეს მხოლოდ ინგლისურ სიმბოლოებს.',
            ],
            'ka' => [
                'regex' => 'ქართული აღწერა უნდა შეიცავდეს მხოლოდ ქართულ სიმბოლოებს.',
            ],
        ],
    ],

    'attributes' => [
        'email'            => 'ელ-ფოსტის',
        'password'         => 'პაროლის',
        'profile_picture'  => 'პროფილის ფოტო',
        'cover_picture'    => 'გარეკანის ფოტო',
        'current_password' => 'მიმდინარე პაროლი',
        'new_password'     => 'ახალი პაროლი',
        'title.en'         => 'ინგლისური სათაურის',
        'title.ka'         => 'ქართული სათაურის',
        'description.en'   => 'ინგლისური აღწერის',
        'description.ka'   => 'ქართული აღწერის',
        'due_date'         => 'შესრულების თარიღის',
    ],
];
